AUTO_config_TK_pesok/src/InformationRegisters/ТК_СостояниеEDI/ТК_СостояниеEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_СостояниеEDI</name>
  <resources>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DocumentRef.ТК_СообщениеEDIВходящее</types>
      <types>DocumentRef.ТК_СообщениеEDIИсходящие</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеВерсии</name>
    <type>
      <types>EnumRef.СтатусыДокументовEDI</types>
    </type>
  </resources>
  <resources>
    <name>ДействияСНашейСтороны</name>
    <type>
      <types>EnumRef.ТК_СводныеСостоянияEDI</types>
    </type>
  </resources>
  <resources>
    <name>ДействияСоСтороныДругогоУчастника</name>
    <type>
      <types>EnumRef.ТК_СводныеСостоянияEDI</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DefinedType.ТК_ДокументыEDI</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Enums/СтатусыДокументовEDI/СтатусыДокументовEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовEDI</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноПодписан</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>ПрочитанПолучателем</name>
    <comment>Получено подтверждение о том что получатель прочитал доставленный файл</comment>
  </enumValues>
  <enumValues>
    <name>ДоставленПолучателю</name>
    <comment>Получено подтверждение о доставке</comment>
  </enumValues>
  <enumValues>
    <name>ОтклоненПолучателем</name>
    <comment>Получено сообщени о том что получатель отклонил высланное сообщение</comment>
  </enumValues>
  <enumValues>
    <name>НаРассмотренииУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненПоставщикомФормально</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СогласованПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>НеСформирован</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>НеПолучен</name>
  </enumValues>
  <enumValues>
    <name>НаПодписи</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытПринудительно</name>
  </enumValues>
  <enumValues>
    <name>ОбменЗавершен</name>
  </enumValues>
  <enumValues>
    <name>ОбменЗавершенСИсправлением</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяУточнитьДокумент</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_СостояниеEDI/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		ПредставлениеСтатуса = Строка(Запись.СостояниеВерсии);
		ПредставлениеПрогрессаПодписания = Неопределено;
		
		Если Запись.СостояниеВерсии = Перечисления.СтатусыДокументовEDI.НаПодписи 
			И ЗначениеЗаполнено(Запись.ЭлектронныйДокумент) Тогда
			ПредставлениеПрогрессаПодписания = "";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПредставлениеПрогрессаПодписания) Тогда
			Запись.ПредставлениеСостояния = СтрШаблон("%1 %2", ПредставлениеСтатуса, ПредставлениеПрогрессаПодписания);
		Иначе
			Запись.ПредставлениеСостояния = ПредставлениеСтатуса;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры






#КонецЕсли
